# Training parameters
LEARNING_RATE = 1e-3
DATA_AUGMENTATION = True
REGULARIZATION = 0.0
BATCH_SIZE = 128
EPOCHS = 200
    lr = 1e-3
    if epoch > 180:
        lr *= 0.5e-3
    elif epoch > 160:
        lr *= 1e-3
    elif epoch > 120:
        lr *= 1e-2
    elif epoch > 80:
        lr *= 1e-1


Using TensorFlow backend.
Using data augmentation.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 32, 32, 16)   448         input_1[0][0]
__________________________________________________________________________________________________
conv1_bn (BatchNormalization)   (None, 32, 32, 16)   64          conv1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           conv1_bn[0][0]
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_1[0][0]
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2a[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           bn2a_branch2a[0][0]
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_2[0][0]
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2b[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           bn2a_branch2b[0][0]
                                                                 activation_1[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_3[0][0]
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2a[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           bn2b_branch2a[0][0]
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_4[0][0]
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2b[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           bn2b_branch2b[0][0]
                                                                 activation_3[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_5[0][0]
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2a[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           bn2c_branch2a[0][0]
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_6[0][0]
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2b[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           bn2c_branch2b[0][0]
                                                                 activation_5[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 16, 16, 32)   4640        activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2a[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           bn3a_branch2a[0][0]
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_8[0][0]
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 16, 16, 32)   544         activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2b[0][0]
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 16, 16, 32)   128         res3a_branch1[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           bn3a_branch2b[0][0]
                                                                 bn3a_branch1[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_9[0][0]
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2a[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           bn3b_branch2a[0][0]
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_10[0][0]
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2b[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           bn3b_branch2b[0][0]
                                                                 activation_9[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_11[0][0]
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2a[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           bn3c_branch2a[0][0]
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_12[0][0]
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2b[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           bn3c_branch2b[0][0]
                                                                 activation_11[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 8, 8, 64)     18496       activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2a[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           bn4a_branch2a[0][0]
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_14[0][0]
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 8, 8, 64)     2112        activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2b[0][0]
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 8, 8, 64)     256         res4a_branch1[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           bn4a_branch2b[0][0]
                                                                 bn4a_branch1[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_15[0][0]
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2a[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           bn4b_branch2a[0][0]
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_16[0][0]
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2b[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           bn4b_branch2b[0][0]
                                                                 activation_15[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_17[0][0]
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2a[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           bn4c_branch2a[0][0]
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_18[0][0]
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2b[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           bn4c_branch2b[0][0]
                                                                 activation_17[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]
__________________________________________________________________________________________________
avg_pool (AveragePooling2D)     (None, 4, 4, 64)     0           activation_19[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1024)         0           avg_pool[0][0]
__________________________________________________________________________________________________
fc (Dense)                      (None, 10)           10250       flatten_1[0][0]
==================================================================================================
Total params: 284,426
Trainable params: 282,858
Non-trainable params: 1,568
__________________________________________________________________________________________________
Epoch 1/200
Learning rate:  0.001
391/391 [==============================] - 26s 66ms/step - loss: 1.7195 - acc: 0.3792 - val_loss: 2.0961 - val_acc: 0.3718
Epoch 2/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 1.4101 - acc: 0.4885 - val_loss: 1.4449 - val_acc: 0.5006
Epoch 3/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 1.2416 - acc: 0.5555 - val_loss: 1.2713 - val_acc: 0.5503
Epoch 4/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 1.1091 - acc: 0.6042 - val_loss: 1.3631 - val_acc: 0.5602
Epoch 5/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.9913 - acc: 0.6489 - val_loss: 1.1293 - val_acc: 0.6391
Epoch 6/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.9130 - acc: 0.6742 - val_loss: 1.0043 - val_acc: 0.6693
Epoch 7/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.8404 - acc: 0.7052 - val_loss: 0.8413 - val_acc: 0.7168
Epoch 8/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.7886 - acc: 0.7260 - val_loss: 0.9550 - val_acc: 0.6994
Epoch 9/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.7408 - acc: 0.7391 - val_loss: 0.7466 - val_acc: 0.7460
Epoch 10/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.7015 - acc: 0.7560 - val_loss: 1.0621 - val_acc: 0.6759
Epoch 11/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.6697 - acc: 0.7678 - val_loss: 0.7637 - val_acc: 0.7557
Epoch 12/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.6363 - acc: 0.7760 - val_loss: 0.7518 - val_acc: 0.7587
Epoch 13/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.6100 - acc: 0.7892 - val_loss: 0.7421 - val_acc: 0.7631
Epoch 14/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.5856 - acc: 0.7973 - val_loss: 0.7112 - val_acc: 0.7714
Epoch 15/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.5669 - acc: 0.8022 - val_loss: 0.7342 - val_acc: 0.7661
Epoch 16/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.5523 - acc: 0.8071 - val_loss: 0.6994 - val_acc: 0.7754
Epoch 17/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.5286 - acc: 0.8162 - val_loss: 0.6794 - val_acc: 0.7797
Epoch 18/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.5135 - acc: 0.8202 - val_loss: 0.5976 - val_acc: 0.8016
Epoch 19/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4952 - acc: 0.8275 - val_loss: 0.8784 - val_acc: 0.7488
Epoch 20/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.4867 - acc: 0.8312 - val_loss: 0.5544 - val_acc: 0.8194
Epoch 21/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4709 - acc: 0.8375 - val_loss: 0.6368 - val_acc: 0.7994
Epoch 22/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4581 - acc: 0.8411 - val_loss: 0.7286 - val_acc: 0.7811
Epoch 23/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4514 - acc: 0.8434 - val_loss: 0.8711 - val_acc: 0.7574
Epoch 24/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4434 - acc: 0.8456 - val_loss: 0.8253 - val_acc: 0.7599
Epoch 25/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4266 - acc: 0.8514 - val_loss: 0.5563 - val_acc: 0.8235
Epoch 26/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4183 - acc: 0.8549 - val_loss: 0.6016 - val_acc: 0.8095
Epoch 27/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4089 - acc: 0.8557 - val_loss: 0.6686 - val_acc: 0.7981
Epoch 28/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.4002 - acc: 0.8609 - val_loss: 0.7035 - val_acc: 0.7939
Epoch 29/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3924 - acc: 0.8633 - val_loss: 0.5668 - val_acc: 0.8260
Epoch 30/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3918 - acc: 0.8634 - val_loss: 0.4910 - val_acc: 0.8355
Epoch 31/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3760 - acc: 0.8686 - val_loss: 0.5491 - val_acc: 0.8275
Epoch 32/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3729 - acc: 0.8707 - val_loss: 0.5147 - val_acc: 0.8424
Epoch 33/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3618 - acc: 0.8749 - val_loss: 0.6541 - val_acc: 0.8159
Epoch 34/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.3594 - acc: 0.8741 - val_loss: 0.6097 - val_acc: 0.8104
Epoch 35/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3516 - acc: 0.8776 - val_loss: 0.5698 - val_acc: 0.8272
Epoch 36/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3485 - acc: 0.8783 - val_loss: 0.5812 - val_acc: 0.8197
Epoch 37/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.3380 - acc: 0.8815 - val_loss: 0.5040 - val_acc: 0.8400
Epoch 38/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3357 - acc: 0.8828 - val_loss: 0.4647 - val_acc: 0.8555
Epoch 39/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3310 - acc: 0.8841 - val_loss: 0.5797 - val_acc: 0.8343
Epoch 40/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3242 - acc: 0.8866 - val_loss: 0.5130 - val_acc: 0.8439
Epoch 41/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3215 - acc: 0.8887 - val_loss: 0.5596 - val_acc: 0.8299
Epoch 42/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.3216 - acc: 0.8867 - val_loss: 0.5323 - val_acc: 0.8412
Epoch 43/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.3143 - acc: 0.8905 - val_loss: 0.5796 - val_acc: 0.8267
Epoch 44/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.3109 - acc: 0.8904 - val_loss: 0.5620 - val_acc: 0.8342
Epoch 45/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.3071 - acc: 0.8925 - val_loss: 0.4434 - val_acc: 0.8682
Epoch 46/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2994 - acc: 0.8953 - val_loss: 0.4859 - val_acc: 0.8530
Epoch 47/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2974 - acc: 0.8955 - val_loss: 0.6488 - val_acc: 0.8172
Epoch 48/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2918 - acc: 0.8982 - val_loss: 0.6794 - val_acc: 0.8080
Epoch 49/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2914 - acc: 0.8971 - val_loss: 0.5376 - val_acc: 0.8450
Epoch 50/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2843 - acc: 0.9005 - val_loss: 0.5841 - val_acc: 0.8421
Epoch 51/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2864 - acc: 0.9003 - val_loss: 0.4960 - val_acc: 0.8491
Epoch 52/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2774 - acc: 0.9008 - val_loss: 0.4421 - val_acc: 0.8629
Epoch 53/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2761 - acc: 0.9035 - val_loss: 0.6364 - val_acc: 0.8172
Epoch 54/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2716 - acc: 0.9055 - val_loss: 0.6970 - val_acc: 0.8119
Epoch 55/200
Learning rate:  0.001
391/391 [==============================] - 23s 60ms/step - loss: 0.2705 - acc: 0.9061 - val_loss: 0.5525 - val_acc: 0.8367
Epoch 56/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2703 - acc: 0.9053 - val_loss: 0.6911 - val_acc: 0.8229
Epoch 57/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2692 - acc: 0.9048 - val_loss: 0.5235 - val_acc: 0.8462
Epoch 58/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2618 - acc: 0.9090 - val_loss: 0.4430 - val_acc: 0.8642
Epoch 59/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2604 - acc: 0.9085 - val_loss: 0.4490 - val_acc: 0.8646
Epoch 60/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2566 - acc: 0.9106 - val_loss: 0.5522 - val_acc: 0.8444
Epoch 61/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2554 - acc: 0.9100 - val_loss: 0.5820 - val_acc: 0.8449
Epoch 62/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2520 - acc: 0.9110 - val_loss: 0.4275 - val_acc: 0.8749
Epoch 63/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2454 - acc: 0.9135 - val_loss: 0.4357 - val_acc: 0.8709
Epoch 64/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2459 - acc: 0.9150 - val_loss: 0.4306 - val_acc: 0.8706
Epoch 65/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2416 - acc: 0.9158 - val_loss: 0.4623 - val_acc: 0.8650
Epoch 66/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2381 - acc: 0.9155 - val_loss: 0.4731 - val_acc: 0.8641
Epoch 67/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2494 - acc: 0.9127 - val_loss: 0.4679 - val_acc: 0.8583
Epoch 68/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2387 - acc: 0.9167 - val_loss: 0.5139 - val_acc: 0.8524
Epoch 69/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2315 - acc: 0.9193 - val_loss: 0.5466 - val_acc: 0.8480
Epoch 70/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2339 - acc: 0.9171 - val_loss: 0.5726 - val_acc: 0.8479
Epoch 71/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2321 - acc: 0.9176 - val_loss: 0.4897 - val_acc: 0.8600
Epoch 72/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2278 - acc: 0.9194 - val_loss: 0.5978 - val_acc: 0.8399
Epoch 73/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2271 - acc: 0.9197 - val_loss: 0.5913 - val_acc: 0.8381
Epoch 74/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2278 - acc: 0.9191 - val_loss: 0.4986 - val_acc: 0.8622
Epoch 75/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2269 - acc: 0.9210 - val_loss: 0.5787 - val_acc: 0.8406
Epoch 76/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2245 - acc: 0.9210 - val_loss: 0.5072 - val_acc: 0.8557
Epoch 77/200
Learning rate:  0.001
391/391 [==============================] - 22s 56ms/step - loss: 0.2217 - acc: 0.9227 - val_loss: 0.4457 - val_acc: 0.8755
Epoch 78/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2148 - acc: 0.9241 - val_loss: 0.5059 - val_acc: 0.8575
Epoch 79/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2184 - acc: 0.9232 - val_loss: 0.5469 - val_acc: 0.8541
Epoch 80/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2160 - acc: 0.9246 - val_loss: 0.5387 - val_acc: 0.8558
Epoch 81/200
Learning rate:  0.001
391/391 [==============================] - 22s 57ms/step - loss: 0.2105 - acc: 0.9256 - val_loss: 0.5148 - val_acc: 0.8587
Epoch 82/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1779 - acc: 0.9371 - val_loss: 0.4026 - val_acc: 0.8867
Epoch 83/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1612 - acc: 0.9433 - val_loss: 0.3847 - val_acc: 0.8920
Epoch 84/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1592 - acc: 0.9443 - val_loss: 0.3688 - val_acc: 0.8935
Epoch 85/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1539 - acc: 0.9460 - val_loss: 0.3875 - val_acc: 0.8899
Epoch 86/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1528 - acc: 0.9462 - val_loss: 0.3832 - val_acc: 0.8908
Epoch 87/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1481 - acc: 0.9479 - val_loss: 0.3936 - val_acc: 0.8892
Epoch 88/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1471 - acc: 0.9482 - val_loss: 0.3918 - val_acc: 0.8893
Epoch 89/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1472 - acc: 0.9483 - val_loss: 0.4012 - val_acc: 0.8905
Epoch 90/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1458 - acc: 0.9491 - val_loss: 0.3712 - val_acc: 0.8949
Epoch 91/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1422 - acc: 0.9494 - val_loss: 0.3967 - val_acc: 0.8914
Epoch 92/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1411 - acc: 0.9505 - val_loss: 0.4051 - val_acc: 0.8899
Epoch 93/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1429 - acc: 0.9478 - val_loss: 0.3922 - val_acc: 0.8942
Epoch 94/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1402 - acc: 0.9504 - val_loss: 0.4053 - val_acc: 0.8915
Epoch 95/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1419 - acc: 0.9508 - val_loss: 0.4037 - val_acc: 0.8917
Epoch 96/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1384 - acc: 0.9516 - val_loss: 0.3993 - val_acc: 0.8919
Epoch 97/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1383 - acc: 0.9516 - val_loss: 0.4191 - val_acc: 0.8879
Epoch 98/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1374 - acc: 0.9520 - val_loss: 0.4148 - val_acc: 0.8909
Epoch 99/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1379 - acc: 0.9508 - val_loss: 0.3908 - val_acc: 0.8958
Epoch 100/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1339 - acc: 0.9527 - val_loss: 0.3979 - val_acc: 0.8930
Epoch 101/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1370 - acc: 0.9512 - val_loss: 0.3836 - val_acc: 0.8937
Epoch 102/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1314 - acc: 0.9540 - val_loss: 0.3903 - val_acc: 0.8974
Epoch 103/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1328 - acc: 0.9525 - val_loss: 0.3933 - val_acc: 0.8942
Epoch 104/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1337 - acc: 0.9536 - val_loss: 0.4062 - val_acc: 0.8936
Epoch 105/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1283 - acc: 0.9540 - val_loss: 0.3947 - val_acc: 0.8940
Epoch 106/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1316 - acc: 0.9536 - val_loss: 0.3947 - val_acc: 0.8945
Epoch 107/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1302 - acc: 0.9535 - val_loss: 0.4162 - val_acc: 0.8908
Epoch 108/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1327 - acc: 0.9527 - val_loss: 0.4089 - val_acc: 0.8900
Epoch 109/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1288 - acc: 0.9546 - val_loss: 0.3905 - val_acc: 0.8980
Epoch 110/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1320 - acc: 0.9531 - val_loss: 0.3968 - val_acc: 0.8942
Epoch 111/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1272 - acc: 0.9547 - val_loss: 0.4118 - val_acc: 0.8923
Epoch 112/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1254 - acc: 0.9556 - val_loss: 0.3928 - val_acc: 0.8944
Epoch 113/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1251 - acc: 0.9558 - val_loss: 0.4160 - val_acc: 0.8922
Epoch 114/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1274 - acc: 0.9558 - val_loss: 0.4363 - val_acc: 0.8866
Epoch 115/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1243 - acc: 0.9550 - val_loss: 0.3931 - val_acc: 0.8944
Epoch 116/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1274 - acc: 0.9550 - val_loss: 0.4018 - val_acc: 0.8961
Epoch 117/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1261 - acc: 0.9553 - val_loss: 0.4051 - val_acc: 0.8941
Epoch 118/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1249 - acc: 0.9554 - val_loss: 0.4016 - val_acc: 0.8958
Epoch 119/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1277 - acc: 0.9549 - val_loss: 0.4104 - val_acc: 0.8933
Epoch 120/200
Learning rate:  0.0001
391/391 [==============================] - 22s 57ms/step - loss: 0.1225 - acc: 0.9570 - val_loss: 0.4088 - val_acc: 0.8937
Epoch 121/200
Learning rate:  0.0001
391/391 [==============================] - 22s 56ms/step - loss: 0.1224 - acc: 0.9579 - val_loss: 0.4242 - val_acc: 0.8935
Epoch 122/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1210 - acc: 0.9576 - val_loss: 0.4130 - val_acc: 0.8923
Epoch 123/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1222 - acc: 0.9571 - val_loss: 0.4097 - val_acc: 0.8930
Epoch 124/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1231 - acc: 0.9578 - val_loss: 0.4099 - val_acc: 0.8930
Epoch 125/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1210 - acc: 0.9572 - val_loss: 0.4093 - val_acc: 0.8940
Epoch 126/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1180 - acc: 0.9586 - val_loss: 0.4088 - val_acc: 0.8932
Epoch 127/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1210 - acc: 0.9572 - val_loss: 0.4093 - val_acc: 0.8933
Epoch 128/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1181 - acc: 0.9592 - val_loss: 0.4086 - val_acc: 0.8937
Epoch 129/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1200 - acc: 0.9572 - val_loss: 0.4088 - val_acc: 0.8941
Epoch 130/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1155 - acc: 0.9590 - val_loss: 0.4078 - val_acc: 0.8948
Epoch 131/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1186 - acc: 0.9573 - val_loss: 0.4108 - val_acc: 0.8941
Epoch 132/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1188 - acc: 0.9585 - val_loss: 0.4061 - val_acc: 0.8939
Epoch 133/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1187 - acc: 0.9586 - val_loss: 0.4074 - val_acc: 0.8944
Epoch 134/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1202 - acc: 0.9575 - val_loss: 0.4082 - val_acc: 0.8946
Epoch 135/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1177 - acc: 0.9583 - val_loss: 0.4087 - val_acc: 0.8947
Epoch 136/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1182 - acc: 0.9586 - val_loss: 0.4059 - val_acc: 0.8950
Epoch 137/200
Learning rate:  1e-05
391/391 [==============================] - 23s 60ms/step - loss: 0.1161 - acc: 0.9582 - val_loss: 0.4063 - val_acc: 0.8946
Epoch 138/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1164 - acc: 0.9586 - val_loss: 0.4078 - val_acc: 0.8944
Epoch 139/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1179 - acc: 0.9585 - val_loss: 0.4053 - val_acc: 0.8947
Epoch 140/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1180 - acc: 0.9577 - val_loss: 0.4090 - val_acc: 0.8942
Epoch 141/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1177 - acc: 0.9582 - val_loss: 0.4068 - val_acc: 0.8954
Epoch 142/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1189 - acc: 0.9584 - val_loss: 0.4057 - val_acc: 0.8943
Epoch 143/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1153 - acc: 0.9597 - val_loss: 0.4056 - val_acc: 0.8956
Epoch 144/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1178 - acc: 0.9589 - val_loss: 0.4101 - val_acc: 0.8936
Epoch 145/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1180 - acc: 0.9585 - val_loss: 0.4083 - val_acc: 0.8941
Epoch 146/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1177 - acc: 0.9584 - val_loss: 0.4066 - val_acc: 0.8942
Epoch 147/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1162 - acc: 0.9596 - val_loss: 0.4085 - val_acc: 0.8941
Epoch 148/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1145 - acc: 0.9592 - val_loss: 0.4079 - val_acc: 0.8942
Epoch 149/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1163 - acc: 0.9587 - val_loss: 0.4083 - val_acc: 0.8944
Epoch 150/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1136 - acc: 0.9598 - val_loss: 0.4089 - val_acc: 0.8944
Epoch 151/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1172 - acc: 0.9589 - val_loss: 0.4082 - val_acc: 0.8944
Epoch 152/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1163 - acc: 0.9581 - val_loss: 0.4064 - val_acc: 0.8954
Epoch 153/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1165 - acc: 0.9588 - val_loss: 0.4098 - val_acc: 0.8947
Epoch 154/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1158 - acc: 0.9588 - val_loss: 0.4107 - val_acc: 0.8942
Epoch 155/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1175 - acc: 0.9583 - val_loss: 0.4064 - val_acc: 0.8943
Epoch 156/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1156 - acc: 0.9593 - val_loss: 0.4090 - val_acc: 0.8941
Epoch 157/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1162 - acc: 0.9586 - val_loss: 0.4109 - val_acc: 0.8937
Epoch 158/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1161 - acc: 0.9589 - val_loss: 0.4080 - val_acc: 0.8941
Epoch 159/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1138 - acc: 0.9601 - val_loss: 0.4101 - val_acc: 0.8949
Epoch 160/200
Learning rate:  1e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1171 - acc: 0.9594 - val_loss: 0.4108 - val_acc: 0.8947
Epoch 161/200
Learning rate:  1e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1175 - acc: 0.9580 - val_loss: 0.4088 - val_acc: 0.8947
Epoch 162/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1129 - acc: 0.9598 - val_loss: 0.4084 - val_acc: 0.8942
Epoch 163/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1162 - acc: 0.9581 - val_loss: 0.4081 - val_acc: 0.8948
Epoch 164/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1157 - acc: 0.9588 - val_loss: 0.4109 - val_acc: 0.8944
Epoch 165/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1181 - acc: 0.9591 - val_loss: 0.4085 - val_acc: 0.8947
Epoch 166/200
Learning rate:  1e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1138 - acc: 0.9600 - val_loss: 0.4078 - val_acc: 0.8949
Epoch 167/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1181 - acc: 0.9577 - val_loss: 0.4094 - val_acc: 0.8947
Epoch 168/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1132 - acc: 0.9607 - val_loss: 0.4084 - val_acc: 0.8949
Epoch 169/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1139 - acc: 0.9601 - val_loss: 0.4089 - val_acc: 0.8946
Epoch 170/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1158 - acc: 0.9591 - val_loss: 0.4095 - val_acc: 0.8948
Epoch 171/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1176 - acc: 0.9581 - val_loss: 0.4092 - val_acc: 0.8943
Epoch 172/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1183 - acc: 0.9574 - val_loss: 0.4094 - val_acc: 0.8944
Epoch 173/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1160 - acc: 0.9586 - val_loss: 0.4095 - val_acc: 0.8948
Epoch 174/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1160 - acc: 0.9594 - val_loss: 0.4117 - val_acc: 0.8948
Epoch 175/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1168 - acc: 0.9590 - val_loss: 0.4098 - val_acc: 0.8948
Epoch 176/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1175 - acc: 0.9577 - val_loss: 0.4108 - val_acc: 0.8943
Epoch 177/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1159 - acc: 0.9591 - val_loss: 0.4104 - val_acc: 0.8942
Epoch 178/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1156 - acc: 0.9594 - val_loss: 0.4104 - val_acc: 0.8942
Epoch 179/200
Learning rate:  1e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1165 - acc: 0.9595 - val_loss: 0.4105 - val_acc: 0.8945
Epoch 180/200
Learning rate:  1e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1100 - acc: 0.9612 - val_loss: 0.4110 - val_acc: 0.8945
Epoch 181/200
Learning rate:  1e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1149 - acc: 0.9590 - val_loss: 0.4101 - val_acc: 0.8945
Epoch 182/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1160 - acc: 0.9595 - val_loss: 0.4116 - val_acc: 0.8943
Epoch 183/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1155 - acc: 0.9587 - val_loss: 0.4117 - val_acc: 0.8946
Epoch 184/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1183 - acc: 0.9586 - val_loss: 0.4091 - val_acc: 0.8947
Epoch 185/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1150 - acc: 0.9591 - val_loss: 0.4082 - val_acc: 0.8947
Epoch 186/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1150 - acc: 0.9591 - val_loss: 0.4093 - val_acc: 0.8949
Epoch 187/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1160 - acc: 0.9592 - val_loss: 0.4092 - val_acc: 0.8948
Epoch 188/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1177 - acc: 0.9586 - val_loss: 0.4094 - val_acc: 0.8946
Epoch 189/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1126 - acc: 0.9606 - val_loss: 0.4081 - val_acc: 0.8954
Epoch 190/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1145 - acc: 0.9611 - val_loss: 0.4091 - val_acc: 0.8954
Epoch 191/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1135 - acc: 0.9597 - val_loss: 0.4113 - val_acc: 0.8946
Epoch 192/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1139 - acc: 0.9593 - val_loss: 0.4102 - val_acc: 0.8948
Epoch 193/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1154 - acc: 0.9591 - val_loss: 0.4077 - val_acc: 0.8945
Epoch 194/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1159 - acc: 0.9603 - val_loss: 0.4085 - val_acc: 0.8949
Epoch 195/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1160 - acc: 0.9589 - val_loss: 0.4095 - val_acc: 0.8953
Epoch 196/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1141 - acc: 0.9603 - val_loss: 0.4105 - val_acc: 0.8949
Epoch 197/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1163 - acc: 0.9584 - val_loss: 0.4111 - val_acc: 0.8949
Epoch 198/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1137 - acc: 0.9591 - val_loss: 0.4091 - val_acc: 0.8953
Epoch 199/200
Learning rate:  5e-07
391/391 [==============================] - 22s 57ms/step - loss: 0.1150 - acc: 0.9588 - val_loss: 0.4125 - val_acc: 0.8947
Epoch 200/200
Learning rate:  5e-07
391/391 [==============================] - 22s 56ms/step - loss: 0.1128 - acc: 0.9604 - val_loss: 0.4095 - val_acc: 0.8946