# Training parameters
LEARNING_RATE = 1e-3
DATA_AUGMENTATION = True 
REGULARIZATION = 0.0
BATCH_SIZE = 128
EPOCHS = 200


Using TensorFlow backend.
Using data augmentation.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 32, 32, 16)   448         input_1[0][0]
__________________________________________________________________________________________________
conv1_bn (BatchNormalization)   (None, 32, 32, 16)   64          conv1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           conv1_bn[0][0]
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_1[0][0]
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2a[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           bn2a_branch2a[0][0]
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_2[0][0]
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2b[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           bn2a_branch2b[0][0]
                                                                 activation_1[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_3[0][0]
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2a[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           bn2b_branch2a[0][0]
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_4[0][0]
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2b[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           bn2b_branch2b[0][0]
                                                                 activation_3[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_5[0][0]
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2a[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           bn2c_branch2a[0][0]
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_6[0][0]
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2b[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           bn2c_branch2b[0][0]
                                                                 activation_5[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 16, 16, 32)   4640        activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2a[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           bn3a_branch2a[0][0]
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_8[0][0]
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 16, 16, 32)   544         activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2b[0][0]
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 16, 16, 32)   128         res3a_branch1[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           bn3a_branch2b[0][0]
                                                                 bn3a_branch1[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_9[0][0]
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2a[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           bn3b_branch2a[0][0]
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_10[0][0]
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2b[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           bn3b_branch2b[0][0]
                                                                 activation_9[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_11[0][0]
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2a[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           bn3c_branch2a[0][0]
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_12[0][0]
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2b[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           bn3c_branch2b[0][0]
                                                                 activation_11[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 8, 8, 64)     18496       activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2a[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           bn4a_branch2a[0][0]
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_14[0][0]
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 8, 8, 64)     2112        activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2b[0][0]
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 8, 8, 64)     256         res4a_branch1[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           bn4a_branch2b[0][0]
                                                                 bn4a_branch1[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_15[0][0]
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2a[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           bn4b_branch2a[0][0]
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_16[0][0]
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2b[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           bn4b_branch2b[0][0]
                                                                 activation_15[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_17[0][0]
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2a[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           bn4c_branch2a[0][0]
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_18[0][0]
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2b[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           bn4c_branch2b[0][0]
                                                                 activation_17[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]
__________________________________________________________________________________________________
avg_pool (AveragePooling2D)     (None, 4, 4, 64)     0           activation_19[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1024)         0           avg_pool[0][0]
__________________________________________________________________________________________________
fc (Dense)                      (None, 10)           10250       flatten_1[0][0]
==================================================================================================
Total params: 284,426
Trainable params: 282,858
Non-trainable params: 1,568
__________________________________________________________________________________________________
Epoch 1/200
391/391 [==============================] - 26s 66ms/step - loss: 1.7473 - acc: 0.3763 - val_loss: 1.8170 - val_acc: 0.4172
Epoch 2/200
391/391 [==============================] - 22s 57ms/step - loss: 1.3946 - acc: 0.4977 - val_loss: 1.9215 - val_acc: 0.4636
Epoch 3/200
391/391 [==============================] - 22s 57ms/step - loss: 1.2269 - acc: 0.5583 - val_loss: 1.4171 - val_acc: 0.5500
Epoch 4/200
391/391 [==============================] - 22s 57ms/step - loss: 1.0881 - acc: 0.6113 - val_loss: 1.2712 - val_acc: 0.5899
Epoch 5/200
391/391 [==============================] - 22s 56ms/step - loss: 0.9926 - acc: 0.6474 - val_loss: 1.4027 - val_acc: 0.5773
Epoch 6/200
391/391 [==============================] - 22s 56ms/step - loss: 0.9142 - acc: 0.6776 - val_loss: 1.3579 - val_acc: 0.6143
Epoch 7/200
391/391 [==============================] - 22s 57ms/step - loss: 0.8514 - acc: 0.6983 - val_loss: 1.0044 - val_acc: 0.6811
Epoch 8/200
391/391 [==============================] - 22s 57ms/step - loss: 0.8002 - acc: 0.7195 - val_loss: 1.0830 - val_acc: 0.6536
Epoch 9/200
391/391 [==============================] - 22s 57ms/step - loss: 0.7595 - acc: 0.7356 - val_loss: 0.9391 - val_acc: 0.7059
Epoch 10/200
391/391 [==============================] - 22s 56ms/step - loss: 0.7123 - acc: 0.7491 - val_loss: 1.0561 - val_acc: 0.6825
Epoch 11/200
391/391 [==============================] - 22s 56ms/step - loss: 0.6844 - acc: 0.7612 - val_loss: 1.0384 - val_acc: 0.6859
Epoch 12/200
391/391 [==============================] - 22s 57ms/step - loss: 0.6561 - acc: 0.7716 - val_loss: 0.7969 - val_acc: 0.7490
Epoch 13/200
391/391 [==============================] - 22s 56ms/step - loss: 0.6291 - acc: 0.7813 - val_loss: 0.7460 - val_acc: 0.7713
Epoch 14/200
391/391 [==============================] - 22s 57ms/step - loss: 0.6080 - acc: 0.7877 - val_loss: 0.7007 - val_acc: 0.7710
Epoch 15/200
391/391 [==============================] - 22s 57ms/step - loss: 0.5918 - acc: 0.7941 - val_loss: 0.9050 - val_acc: 0.7237
Epoch 16/200
391/391 [==============================] - 22s 57ms/step - loss: 0.5696 - acc: 0.8029 - val_loss: 0.5671 - val_acc: 0.8071
Epoch 17/200
391/391 [==============================] - 22s 56ms/step - loss: 0.5508 - acc: 0.8073 - val_loss: 0.6040 - val_acc: 0.8013
Epoch 18/200
391/391 [==============================] - 22s 56ms/step - loss: 0.5329 - acc: 0.8134 - val_loss: 0.7857 - val_acc: 0.7634
Epoch 19/200
391/391 [==============================] - 22s 57ms/step - loss: 0.5214 - acc: 0.8191 - val_loss: 0.9524 - val_acc: 0.7245
Epoch 20/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4997 - acc: 0.8251 - val_loss: 0.7670 - val_acc: 0.7617
Epoch 21/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4900 - acc: 0.8290 - val_loss: 1.2966 - val_acc: 0.6821
Epoch 22/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4837 - acc: 0.8329 - val_loss: 0.8439 - val_acc: 0.7536
Epoch 23/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4700 - acc: 0.8363 - val_loss: 0.6304 - val_acc: 0.8092
Epoch 24/200
391/391 [==============================] - 22s 56ms/step - loss: 0.4592 - acc: 0.8416 - val_loss: 0.6913 - val_acc: 0.7973
Epoch 25/200
391/391 [==============================] - 22s 56ms/step - loss: 0.4487 - acc: 0.8428 - val_loss: 0.5854 - val_acc: 0.8106
Epoch 26/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4406 - acc: 0.8460 - val_loss: 0.7108 - val_acc: 0.7917
Epoch 27/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4306 - acc: 0.8512 - val_loss: 0.7997 - val_acc: 0.7710
Epoch 28/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4215 - acc: 0.8516 - val_loss: 0.6790 - val_acc: 0.7944
Epoch 29/200
391/391 [==============================] - 22s 57ms/step - loss: 0.4096 - acc: 0.8582 - val_loss: 0.6814 - val_acc: 0.7929
Epoch 30/200
391/391 [==============================] - 22s 56ms/step - loss: 0.4059 - acc: 0.8585 - val_loss: 0.7287 - val_acc: 0.7874
Epoch 31/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3991 - acc: 0.8617 - val_loss: 0.5776 - val_acc: 0.8215
Epoch 32/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3918 - acc: 0.8638 - val_loss: 0.8557 - val_acc: 0.7593
Epoch 33/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3827 - acc: 0.8652 - val_loss: 0.5529 - val_acc: 0.8288
Epoch 34/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3822 - acc: 0.8645 - val_loss: 0.5721 - val_acc: 0.8283
Epoch 35/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3681 - acc: 0.8702 - val_loss: 0.5223 - val_acc: 0.8347
Epoch 36/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3634 - acc: 0.8721 - val_loss: 0.6744 - val_acc: 0.8083
Epoch 37/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3607 - acc: 0.8736 - val_loss: 0.6485 - val_acc: 0.8144
Epoch 38/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3545 - acc: 0.8757 - val_loss: 0.6447 - val_acc: 0.8174
Epoch 39/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3508 - acc: 0.8768 - val_loss: 0.6525 - val_acc: 0.8094
Epoch 40/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3394 - acc: 0.8814 - val_loss: 0.4390 - val_acc: 0.8539
Epoch 41/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3379 - acc: 0.8825 - val_loss: 0.5623 - val_acc: 0.8272
Epoch 42/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3294 - acc: 0.8849 - val_loss: 0.5604 - val_acc: 0.8342
Epoch 43/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3327 - acc: 0.8828 - val_loss: 0.4798 - val_acc: 0.8492
Epoch 44/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3193 - acc: 0.8885 - val_loss: 0.4942 - val_acc: 0.8476
Epoch 45/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3189 - acc: 0.8876 - val_loss: 0.5030 - val_acc: 0.8500
Epoch 46/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3156 - acc: 0.8895 - val_loss: 0.7183 - val_acc: 0.7946
Epoch 47/200
391/391 [==============================] - 22s 57ms/step - loss: 0.3105 - acc: 0.8920 - val_loss: 0.6462 - val_acc: 0.8074
Epoch 48/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3101 - acc: 0.8913 - val_loss: 0.5279 - val_acc: 0.8424
Epoch 49/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3050 - acc: 0.8934 - val_loss: 0.5092 - val_acc: 0.8458
Epoch 50/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3035 - acc: 0.8934 - val_loss: 0.8323 - val_acc: 0.7874
Epoch 51/200
391/391 [==============================] - 22s 56ms/step - loss: 0.3012 - acc: 0.8940 - val_loss: 0.5530 - val_acc: 0.8422
Epoch 52/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2953 - acc: 0.8962 - val_loss: 0.5896 - val_acc: 0.8330
Epoch 53/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2937 - acc: 0.8963 - val_loss: 0.6921 - val_acc: 0.8119
Epoch 54/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2862 - acc: 0.8999 - val_loss: 0.5023 - val_acc: 0.8518
Epoch 55/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2870 - acc: 0.8981 - val_loss: 0.6870 - val_acc: 0.8124
Epoch 56/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2866 - acc: 0.8997 - val_loss: 0.6418 - val_acc: 0.8241
Epoch 57/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2762 - acc: 0.9035 - val_loss: 0.4491 - val_acc: 0.8636
Epoch 58/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2783 - acc: 0.9023 - val_loss: 0.5590 - val_acc: 0.8347
Epoch 59/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2697 - acc: 0.9055 - val_loss: 0.5091 - val_acc: 0.8493
Epoch 60/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2660 - acc: 0.9058 - val_loss: 0.5557 - val_acc: 0.8417
Epoch 61/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2697 - acc: 0.9046 - val_loss: 0.5114 - val_acc: 0.8488
Epoch 62/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2642 - acc: 0.9087 - val_loss: 0.6530 - val_acc: 0.8226
Epoch 63/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2643 - acc: 0.9076 - val_loss: 0.4614 - val_acc: 0.8567
Epoch 64/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2586 - acc: 0.9075 - val_loss: 0.4728 - val_acc: 0.8637
Epoch 65/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2549 - acc: 0.9108 - val_loss: 0.5136 - val_acc: 0.8541
Epoch 66/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2531 - acc: 0.9107 - val_loss: 0.5018 - val_acc: 0.8510
Epoch 67/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2492 - acc: 0.9129 - val_loss: 0.4411 - val_acc: 0.8665
Epoch 68/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2559 - acc: 0.9091 - val_loss: 0.6526 - val_acc: 0.8225
Epoch 69/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2475 - acc: 0.9127 - val_loss: 0.5768 - val_acc: 0.8456
Epoch 70/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2406 - acc: 0.9154 - val_loss: 0.5348 - val_acc: 0.8506
Epoch 71/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2424 - acc: 0.9140 - val_loss: 0.5048 - val_acc: 0.8518
Epoch 72/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2382 - acc: 0.9159 - val_loss: 0.5471 - val_acc: 0.8441
Epoch 73/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2378 - acc: 0.9160 - val_loss: 0.5029 - val_acc: 0.8592
Epoch 74/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2380 - acc: 0.9162 - val_loss: 0.5577 - val_acc: 0.8423
Epoch 75/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2386 - acc: 0.9160 - val_loss: 0.5276 - val_acc: 0.8515
Epoch 76/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2319 - acc: 0.9183 - val_loss: 0.5602 - val_acc: 0.8478
Epoch 77/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2344 - acc: 0.9183 - val_loss: 0.4636 - val_acc: 0.8646
Epoch 78/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2324 - acc: 0.9190 - val_loss: 0.5440 - val_acc: 0.8511
Epoch 79/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2256 - acc: 0.9202 - val_loss: 0.4892 - val_acc: 0.8623
Epoch 80/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2289 - acc: 0.9183 - val_loss: 0.4570 - val_acc: 0.8711
Epoch 81/200
391/391 [==============================] - 24s 60ms/step - loss: 0.2213 - acc: 0.9220 - val_loss: 0.4367 - val_acc: 0.8763
Epoch 82/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2243 - acc: 0.9208 - val_loss: 0.5478 - val_acc: 0.8436
Epoch 83/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2227 - acc: 0.9202 - val_loss: 0.5750 - val_acc: 0.8483
Epoch 84/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2176 - acc: 0.9230 - val_loss: 0.4476 - val_acc: 0.8654
Epoch 85/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2171 - acc: 0.9238 - val_loss: 0.4616 - val_acc: 0.8707
Epoch 86/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2198 - acc: 0.9226 - val_loss: 0.6209 - val_acc: 0.8419
Epoch 87/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2104 - acc: 0.9262 - val_loss: 0.4331 - val_acc: 0.8696
Epoch 88/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2113 - acc: 0.9255 - val_loss: 0.5250 - val_acc: 0.8611
Epoch 89/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2142 - acc: 0.9241 - val_loss: 0.6078 - val_acc: 0.8379
Epoch 90/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2071 - acc: 0.9261 - val_loss: 0.5049 - val_acc: 0.8611
Epoch 91/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2081 - acc: 0.9269 - val_loss: 0.5994 - val_acc: 0.8433
Epoch 92/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2122 - acc: 0.9251 - val_loss: 0.4921 - val_acc: 0.8684
Epoch 93/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2066 - acc: 0.9275 - val_loss: 0.5408 - val_acc: 0.8550
Epoch 94/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2038 - acc: 0.9271 - val_loss: 0.5353 - val_acc: 0.8522
Epoch 95/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2069 - acc: 0.9267 - val_loss: 0.4285 - val_acc: 0.8715
Epoch 96/200
391/391 [==============================] - 22s 57ms/step - loss: 0.2001 - acc: 0.9300 - val_loss: 0.5320 - val_acc: 0.8523
Epoch 97/200
391/391 [==============================] - 22s 56ms/step - loss: 0.2045 - acc: 0.9276 - val_loss: 0.5872 - val_acc: 0.8460
Epoch 98/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1971 - acc: 0.9299 - val_loss: 0.5694 - val_acc: 0.8504
Epoch 99/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1979 - acc: 0.9292 - val_loss: 0.4816 - val_acc: 0.8676
Epoch 100/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1962 - acc: 0.9294 - val_loss: 0.4344 - val_acc: 0.8823
Epoch 101/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1946 - acc: 0.9304 - val_loss: 0.4850 - val_acc: 0.8620
Epoch 102/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1912 - acc: 0.9323 - val_loss: 0.5099 - val_acc: 0.8634
Epoch 103/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1920 - acc: 0.9327 - val_loss: 0.4378 - val_acc: 0.8805
Epoch 104/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1917 - acc: 0.9335 - val_loss: 0.4309 - val_acc: 0.8782
Epoch 105/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1911 - acc: 0.9319 - val_loss: 0.5387 - val_acc: 0.8587
Epoch 106/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1888 - acc: 0.9333 - val_loss: 0.5021 - val_acc: 0.8657
Epoch 107/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1920 - acc: 0.9319 - val_loss: 0.5298 - val_acc: 0.8556
Epoch 108/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1869 - acc: 0.9332 - val_loss: 0.4262 - val_acc: 0.8793
Epoch 109/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1828 - acc: 0.9342 - val_loss: 0.4680 - val_acc: 0.8712
Epoch 110/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1851 - acc: 0.9361 - val_loss: 0.4515 - val_acc: 0.8744
Epoch 111/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1826 - acc: 0.9355 - val_loss: 0.4541 - val_acc: 0.8797
Epoch 112/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1792 - acc: 0.9362 - val_loss: 0.4155 - val_acc: 0.8857
Epoch 113/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1848 - acc: 0.9359 - val_loss: 0.5223 - val_acc: 0.8621
Epoch 114/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1770 - acc: 0.9377 - val_loss: 0.6495 - val_acc: 0.8446
Epoch 115/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1810 - acc: 0.9368 - val_loss: 0.4428 - val_acc: 0.8842
Epoch 116/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1777 - acc: 0.9375 - val_loss: 0.5889 - val_acc: 0.8410
Epoch 117/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1789 - acc: 0.9363 - val_loss: 0.5627 - val_acc: 0.8580
Epoch 118/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1745 - acc: 0.9384 - val_loss: 0.4905 - val_acc: 0.8733
Epoch 119/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1703 - acc: 0.9384 - val_loss: 0.4844 - val_acc: 0.8695
Epoch 120/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1745 - acc: 0.9383 - val_loss: 0.4987 - val_acc: 0.8761
Epoch 121/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1726 - acc: 0.9391 - val_loss: 0.4878 - val_acc: 0.8698
Epoch 122/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1705 - acc: 0.9399 - val_loss: 0.4319 - val_acc: 0.8826
Epoch 123/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1659 - acc: 0.9409 - val_loss: 0.6054 - val_acc: 0.8575
Epoch 124/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1719 - acc: 0.9404 - val_loss: 0.5508 - val_acc: 0.8560
Epoch 125/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1694 - acc: 0.9397 - val_loss: 0.7079 - val_acc: 0.8329
Epoch 126/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1671 - acc: 0.9398 - val_loss: 0.4520 - val_acc: 0.8779
Epoch 127/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1658 - acc: 0.9411 - val_loss: 0.4632 - val_acc: 0.8797
Epoch 128/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1655 - acc: 0.9420 - val_loss: 0.6623 - val_acc: 0.8505
Epoch 129/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1679 - acc: 0.9400 - val_loss: 0.5064 - val_acc: 0.8688
Epoch 130/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1645 - acc: 0.9412 - val_loss: 0.4784 - val_acc: 0.8785
Epoch 131/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1632 - acc: 0.9420 - val_loss: 0.4203 - val_acc: 0.8818
Epoch 132/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1644 - acc: 0.9410 - val_loss: 0.5556 - val_acc: 0.8631
Epoch 133/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1686 - acc: 0.9414 - val_loss: 0.6217 - val_acc: 0.8571
Epoch 134/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1601 - acc: 0.9438 - val_loss: 0.5102 - val_acc: 0.8716
Epoch 135/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1568 - acc: 0.9438 - val_loss: 0.4491 - val_acc: 0.8807
Epoch 136/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1619 - acc: 0.9431 - val_loss: 0.4831 - val_acc: 0.8772
Epoch 137/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1622 - acc: 0.9424 - val_loss: 0.4332 - val_acc: 0.8828
Epoch 138/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1571 - acc: 0.9452 - val_loss: 0.4810 - val_acc: 0.8780
Epoch 139/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1567 - acc: 0.9442 - val_loss: 0.5580 - val_acc: 0.8595
Epoch 140/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1535 - acc: 0.9460 - val_loss: 0.4827 - val_acc: 0.8801
Epoch 141/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1560 - acc: 0.9435 - val_loss: 0.4494 - val_acc: 0.8800
Epoch 142/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1584 - acc: 0.9437 - val_loss: 0.4956 - val_acc: 0.8761
Epoch 143/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1586 - acc: 0.9431 - val_loss: 0.4980 - val_acc: 0.8755
Epoch 144/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1529 - acc: 0.9451 - val_loss: 0.4721 - val_acc: 0.8763
Epoch 145/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1512 - acc: 0.9458 - val_loss: 0.5149 - val_acc: 0.8698
Epoch 146/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1558 - acc: 0.9443 - val_loss: 0.5395 - val_acc: 0.8743
Epoch 147/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1475 - acc: 0.9468 - val_loss: 0.4796 - val_acc: 0.8770
Epoch 148/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1504 - acc: 0.9463 - val_loss: 0.4696 - val_acc: 0.8781
Epoch 149/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1571 - acc: 0.9447 - val_loss: 0.4301 - val_acc: 0.8836
Epoch 150/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1501 - acc: 0.9472 - val_loss: 0.4963 - val_acc: 0.8789
Epoch 151/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1509 - acc: 0.9464 - val_loss: 0.4767 - val_acc: 0.8812
Epoch 152/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1458 - acc: 0.9490 - val_loss: 0.4737 - val_acc: 0.8772
Epoch 153/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1517 - acc: 0.9453 - val_loss: 0.4521 - val_acc: 0.8765
Epoch 154/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1453 - acc: 0.9488 - val_loss: 0.4363 - val_acc: 0.8877
Epoch 155/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1466 - acc: 0.9484 - val_loss: 0.4955 - val_acc: 0.8799
Epoch 156/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1453 - acc: 0.9488 - val_loss: 0.4455 - val_acc: 0.8856
Epoch 157/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1481 - acc: 0.9475 - val_loss: 0.5832 - val_acc: 0.8661
Epoch 158/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1456 - acc: 0.9491 - val_loss: 0.4572 - val_acc: 0.8822
Epoch 159/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1480 - acc: 0.9481 - val_loss: 0.5552 - val_acc: 0.8674
Epoch 160/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1420 - acc: 0.9505 - val_loss: 0.4326 - val_acc: 0.8912
Epoch 161/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1432 - acc: 0.9498 - val_loss: 0.4440 - val_acc: 0.8891
Epoch 162/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1425 - acc: 0.9484 - val_loss: 0.5837 - val_acc: 0.8667
Epoch 163/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1368 - acc: 0.9511 - val_loss: 0.5414 - val_acc: 0.8726
Epoch 164/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1425 - acc: 0.9488 - val_loss: 0.4766 - val_acc: 0.8778
Epoch 165/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1384 - acc: 0.9504 - val_loss: 0.6096 - val_acc: 0.8592
Epoch 166/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1353 - acc: 0.9517 - val_loss: 0.5378 - val_acc: 0.8739
Epoch 167/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1378 - acc: 0.9515 - val_loss: 0.4520 - val_acc: 0.8900
Epoch 168/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1377 - acc: 0.9504 - val_loss: 0.5542 - val_acc: 0.8679
Epoch 169/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1342 - acc: 0.9530 - val_loss: 0.6116 - val_acc: 0.8656
Epoch 170/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1374 - acc: 0.9518 - val_loss: 0.5329 - val_acc: 0.8770
Epoch 171/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1386 - acc: 0.9507 - val_loss: 0.4501 - val_acc: 0.8831
Epoch 172/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1344 - acc: 0.9523 - val_loss: 0.4743 - val_acc: 0.8838
Epoch 173/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1370 - acc: 0.9514 - val_loss: 0.4472 - val_acc: 0.8882
Epoch 174/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1380 - acc: 0.9514 - val_loss: 0.5012 - val_acc: 0.8842
Epoch 175/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1354 - acc: 0.9515 - val_loss: 0.4182 - val_acc: 0.8931
Epoch 176/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1336 - acc: 0.9520 - val_loss: 0.4588 - val_acc: 0.8895
Epoch 177/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1345 - acc: 0.9532 - val_loss: 0.5406 - val_acc: 0.8768
Epoch 178/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1325 - acc: 0.9537 - val_loss: 0.5089 - val_acc: 0.8734
Epoch 179/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1359 - acc: 0.9521 - val_loss: 0.4532 - val_acc: 0.8877
Epoch 180/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1339 - acc: 0.9532 - val_loss: 0.6670 - val_acc: 0.8570
Epoch 181/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1294 - acc: 0.9545 - val_loss: 0.6741 - val_acc: 0.8535
Epoch 182/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1313 - acc: 0.9533 - val_loss: 0.4697 - val_acc: 0.8813
Epoch 183/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1318 - acc: 0.9533 - val_loss: 0.5787 - val_acc: 0.8692
Epoch 184/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1298 - acc: 0.9543 - val_loss: 0.4731 - val_acc: 0.8859
Epoch 185/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1282 - acc: 0.9545 - val_loss: 0.4745 - val_acc: 0.8843
Epoch 186/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1316 - acc: 0.9531 - val_loss: 0.5552 - val_acc: 0.8751
Epoch 187/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1330 - acc: 0.9523 - val_loss: 0.4635 - val_acc: 0.8905
Epoch 188/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1253 - acc: 0.9567 - val_loss: 0.4942 - val_acc: 0.8836
Epoch 189/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1250 - acc: 0.9554 - val_loss: 0.4713 - val_acc: 0.8914
Epoch 190/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1252 - acc: 0.9559 - val_loss: 0.5108 - val_acc: 0.8796
Epoch 191/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1266 - acc: 0.9541 - val_loss: 0.5380 - val_acc: 0.8801
Epoch 192/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1275 - acc: 0.9548 - val_loss: 0.5669 - val_acc: 0.8699
Epoch 193/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1246 - acc: 0.9557 - val_loss: 0.5657 - val_acc: 0.8730
Epoch 194/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1233 - acc: 0.9564 - val_loss: 0.4814 - val_acc: 0.8866
Epoch 195/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1279 - acc: 0.9545 - val_loss: 0.5085 - val_acc: 0.8781
Epoch 196/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1234 - acc: 0.9558 - val_loss: 0.5671 - val_acc: 0.8724
Epoch 197/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1277 - acc: 0.9544 - val_loss: 0.5259 - val_acc: 0.8801
Epoch 198/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1219 - acc: 0.9567 - val_loss: 0.5169 - val_acc: 0.8808
Epoch 199/200
391/391 [==============================] - 22s 56ms/step - loss: 0.1254 - acc: 0.9559 - val_loss: 0.4649 - val_acc: 0.8858
Epoch 200/200
391/391 [==============================] - 22s 57ms/step - loss: 0.1240 - acc: 0.9566 - val_loss: 0.5027 - val_acc: 0.8839