# Training parameters
LEARNING_RATE = 3e-3
DATA_AUGMENTATION = True 
REGULARIZATION = 0.0
BATCH_SIZE = 128
EPOCHS = 200
    lr = 3e-3
    if epoch > 180:
        lr *= 0.5e-3
    elif epoch > 160:
        lr *= 1e-3
    elif epoch > 120:
        lr *= 1e-2
    elif epoch > 80:
        lr *= 1e-1


Using TensorFlow backend.
Using data augmentation.
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 32, 32, 16)   448         input_1[0][0]
__________________________________________________________________________________________________
conv1_bn (BatchNormalization)   (None, 32, 32, 16)   64          conv1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 32, 32, 16)   0           conv1_bn[0][0]
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_1[0][0]
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2a[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 32, 32, 16)   0           bn2a_branch2a[0][0]
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_2[0][0]
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2a_branch2b[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 32, 32, 16)   0           bn2a_branch2b[0][0]
                                                                 activation_1[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 32, 32, 16)   0           add_1[0][0]
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_3[0][0]
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2a[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 32, 32, 16)   0           bn2b_branch2a[0][0]
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_4[0][0]
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2b_branch2b[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 16)   0           bn2b_branch2b[0][0]
                                                                 activation_3[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 32, 32, 16)   0           add_2[0][0]
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 32, 32, 16)   2320        activation_5[0][0]
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2a[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 32, 32, 16)   0           bn2c_branch2a[0][0]
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 32, 32, 16)   2320        activation_6[0][0]
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 32, 32, 16)   64          res2c_branch2b[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 32, 16)   0           bn2c_branch2b[0][0]
                                                                 activation_5[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 32, 16)   0           add_3[0][0]
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 16, 16, 32)   4640        activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2a[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 16, 16, 32)   0           bn3a_branch2a[0][0]
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_8[0][0]
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 16, 16, 32)   544         activation_7[0][0]
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3a_branch2b[0][0]
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 16, 16, 32)   128         res3a_branch1[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 16, 16, 32)   0           bn3a_branch2b[0][0]
                                                                 bn3a_branch1[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 16, 16, 32)   0           add_4[0][0]
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_9[0][0]
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2a[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 16, 16, 32)   0           bn3b_branch2a[0][0]
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_10[0][0]
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3b_branch2b[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 16, 32)   0           bn3b_branch2b[0][0]
                                                                 activation_9[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 16, 16, 32)   0           add_5[0][0]
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 16, 16, 32)   9248        activation_11[0][0]
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2a[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 16, 16, 32)   0           bn3c_branch2a[0][0]
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 16, 16, 32)   9248        activation_12[0][0]
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 16, 16, 32)   128         res3c_branch2b[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 16, 32)   0           bn3c_branch2b[0][0]
                                                                 activation_11[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 16, 16, 32)   0           add_6[0][0]
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 8, 8, 64)     18496       activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2a[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 8, 8, 64)     0           bn4a_branch2a[0][0]
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_14[0][0]
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 8, 8, 64)     2112        activation_13[0][0]
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4a_branch2b[0][0]
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 8, 8, 64)     256         res4a_branch1[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 8, 64)     0           bn4a_branch2b[0][0]
                                                                 bn4a_branch1[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 8, 8, 64)     0           add_7[0][0]
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_15[0][0]
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2a[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 8, 8, 64)     0           bn4b_branch2a[0][0]
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_16[0][0]
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4b_branch2b[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 8, 64)     0           bn4b_branch2b[0][0]
                                                                 activation_15[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 8, 8, 64)     0           add_8[0][0]
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 8, 8, 64)     36928       activation_17[0][0]
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2a[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 8, 8, 64)     0           bn4c_branch2a[0][0]
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_18[0][0]
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res4c_branch2b[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 8, 8, 64)     0           bn4c_branch2b[0][0]
                                                                 activation_17[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 8, 8, 64)     0           add_9[0][0]
__________________________________________________________________________________________________
avg_pool (AveragePooling2D)     (None, 4, 4, 64)     0           activation_19[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 1024)         0           avg_pool[0][0]
__________________________________________________________________________________________________
fc (Dense)                      (None, 10)           10250       flatten_1[0][0]
==================================================================================================
Total params: 284,426
Trainable params: 282,858
Non-trainable params: 1,568
__________________________________________________________________________________________________
Epoch 1/200
Learning rate:  0.003
391/391 [==============================] - 26s 66ms/step - loss: 1.8285 - acc: 0.3611 - val_loss: 1.8085 - val_acc: 0.3755
Epoch 2/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 1.4356 - acc: 0.4968 - val_loss: 2.7245 - val_acc: 0.3766
Epoch 3/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 1.1982 - acc: 0.5784 - val_loss: 1.6238 - val_acc: 0.5032
Epoch 4/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 1.0316 - acc: 0.6392 - val_loss: 1.6160 - val_acc: 0.5311
Epoch 5/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.9087 - acc: 0.6817 - val_loss: 1.0462 - val_acc: 0.6593
Epoch 6/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.8274 - acc: 0.7114 - val_loss: 1.0673 - val_acc: 0.6500
Epoch 7/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.7604 - acc: 0.7333 - val_loss: 0.9182 - val_acc: 0.7098
Epoch 8/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.7090 - acc: 0.7542 - val_loss: 1.0012 - val_acc: 0.6942
Epoch 9/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.6728 - acc: 0.7671 - val_loss: 1.4064 - val_acc: 0.6414
Epoch 10/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.6326 - acc: 0.7789 - val_loss: 0.9893 - val_acc: 0.7007
Epoch 11/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.6039 - acc: 0.7901 - val_loss: 0.6692 - val_acc: 0.7799
Epoch 12/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.5684 - acc: 0.8036 - val_loss: 1.0121 - val_acc: 0.7015
Epoch 13/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.5498 - acc: 0.8096 - val_loss: 0.7779 - val_acc: 0.7523
Epoch 14/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.5311 - acc: 0.8158 - val_loss: 0.8356 - val_acc: 0.7521
Epoch 15/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.5163 - acc: 0.8234 - val_loss: 0.5943 - val_acc: 0.8016
Epoch 16/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4891 - acc: 0.8316 - val_loss: 1.0228 - val_acc: 0.7349
Epoch 17/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4835 - acc: 0.8331 - val_loss: 0.6238 - val_acc: 0.8009
Epoch 18/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4672 - acc: 0.8376 - val_loss: 0.6022 - val_acc: 0.8044
Epoch 19/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4522 - acc: 0.8440 - val_loss: 0.7524 - val_acc: 0.7762
Epoch 20/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4382 - acc: 0.8488 - val_loss: 0.5897 - val_acc: 0.8108
Epoch 21/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4257 - acc: 0.8527 - val_loss: 0.7434 - val_acc: 0.7751
Epoch 22/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4185 - acc: 0.8566 - val_loss: 0.5671 - val_acc: 0.8185
Epoch 23/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.4092 - acc: 0.8585 - val_loss: 0.6497 - val_acc: 0.7996
Epoch 24/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.3971 - acc: 0.8620 - val_loss: 0.5131 - val_acc: 0.8341
Epoch 25/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3936 - acc: 0.8637 - val_loss: 0.6096 - val_acc: 0.8080
Epoch 26/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3863 - acc: 0.8651 - val_loss: 0.6629 - val_acc: 0.8093
Epoch 27/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3781 - acc: 0.8700 - val_loss: 0.5762 - val_acc: 0.8234
Epoch 28/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3686 - acc: 0.8717 - val_loss: 0.7291 - val_acc: 0.7893
Epoch 29/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3623 - acc: 0.8750 - val_loss: 0.5904 - val_acc: 0.8233
Epoch 30/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3573 - acc: 0.8755 - val_loss: 0.6125 - val_acc: 0.8191
Epoch 31/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3558 - acc: 0.8756 - val_loss: 0.7563 - val_acc: 0.7915
Epoch 32/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3476 - acc: 0.8781 - val_loss: 0.5635 - val_acc: 0.8269
Epoch 33/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3400 - acc: 0.8815 - val_loss: 0.5268 - val_acc: 0.8366
Epoch 34/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3372 - acc: 0.8845 - val_loss: 0.5876 - val_acc: 0.8300
Epoch 35/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3263 - acc: 0.8859 - val_loss: 0.5493 - val_acc: 0.8341
Epoch 36/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3211 - acc: 0.8885 - val_loss: 0.5903 - val_acc: 0.8283
Epoch 37/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3157 - acc: 0.8903 - val_loss: 0.5333 - val_acc: 0.8365
Epoch 38/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3126 - acc: 0.8912 - val_loss: 0.6119 - val_acc: 0.8241
Epoch 39/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3078 - acc: 0.8925 - val_loss: 0.4897 - val_acc: 0.8457
Epoch 40/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.3022 - acc: 0.8952 - val_loss: 0.7478 - val_acc: 0.8006
Epoch 41/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2950 - acc: 0.8981 - val_loss: 0.5979 - val_acc: 0.8336
Epoch 42/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2963 - acc: 0.8972 - val_loss: 0.4705 - val_acc: 0.8568
Epoch 43/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2927 - acc: 0.8971 - val_loss: 0.5346 - val_acc: 0.8396
Epoch 44/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2895 - acc: 0.8986 - val_loss: 0.5986 - val_acc: 0.8284
Epoch 45/200
Learning rate:  0.003
391/391 [==============================] - 23s 60ms/step - loss: 0.2865 - acc: 0.8994 - val_loss: 0.4927 - val_acc: 0.8474
Epoch 46/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2841 - acc: 0.9005 - val_loss: 0.5022 - val_acc: 0.8553
Epoch 47/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2808 - acc: 0.9034 - val_loss: 0.7011 - val_acc: 0.8064
Epoch 48/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2786 - acc: 0.9030 - val_loss: 0.4986 - val_acc: 0.8469
Epoch 49/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2731 - acc: 0.9038 - val_loss: 0.4392 - val_acc: 0.8659
Epoch 50/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2712 - acc: 0.9055 - val_loss: 0.5309 - val_acc: 0.8479
Epoch 51/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2666 - acc: 0.9058 - val_loss: 0.5310 - val_acc: 0.8491
Epoch 52/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2659 - acc: 0.9062 - val_loss: 0.5757 - val_acc: 0.8363
Epoch 53/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2596 - acc: 0.9098 - val_loss: 0.4400 - val_acc: 0.8713
Epoch 54/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2605 - acc: 0.9066 - val_loss: 0.5539 - val_acc: 0.8471
Epoch 55/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2581 - acc: 0.9098 - val_loss: 0.5227 - val_acc: 0.8494
Epoch 56/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2591 - acc: 0.9091 - val_loss: 0.6050 - val_acc: 0.8309
Epoch 57/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2493 - acc: 0.9123 - val_loss: 0.5780 - val_acc: 0.8411
Epoch 58/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2470 - acc: 0.9127 - val_loss: 0.4799 - val_acc: 0.8583
Epoch 59/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2449 - acc: 0.9137 - val_loss: 0.5267 - val_acc: 0.8543
Epoch 60/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2441 - acc: 0.9143 - val_loss: 0.5345 - val_acc: 0.8489
Epoch 61/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2405 - acc: 0.9146 - val_loss: 0.5665 - val_acc: 0.8512
Epoch 62/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2372 - acc: 0.9162 - val_loss: 0.5226 - val_acc: 0.8494
Epoch 63/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2355 - acc: 0.9158 - val_loss: 0.5265 - val_acc: 0.8503
Epoch 64/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2350 - acc: 0.9172 - val_loss: 0.7418 - val_acc: 0.8085
Epoch 65/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2297 - acc: 0.9192 - val_loss: 0.5324 - val_acc: 0.8585
Epoch 66/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2321 - acc: 0.9192 - val_loss: 0.4632 - val_acc: 0.8611
Epoch 67/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2275 - acc: 0.9200 - val_loss: 0.4914 - val_acc: 0.8564
Epoch 68/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2285 - acc: 0.9207 - val_loss: 0.4124 - val_acc: 0.8762
Epoch 69/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2239 - acc: 0.9210 - val_loss: 0.5193 - val_acc: 0.8594
Epoch 70/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2239 - acc: 0.9211 - val_loss: 0.4421 - val_acc: 0.8668
Epoch 71/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2213 - acc: 0.9225 - val_loss: 0.4663 - val_acc: 0.8692
Epoch 72/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2209 - acc: 0.9228 - val_loss: 0.4970 - val_acc: 0.8605
Epoch 73/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2145 - acc: 0.9243 - val_loss: 0.5951 - val_acc: 0.8428
Epoch 74/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2159 - acc: 0.9244 - val_loss: 0.4975 - val_acc: 0.8579
Epoch 75/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2111 - acc: 0.9255 - val_loss: 0.4864 - val_acc: 0.8603
Epoch 76/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2094 - acc: 0.9272 - val_loss: 0.4506 - val_acc: 0.8730
Epoch 77/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2074 - acc: 0.9270 - val_loss: 0.5176 - val_acc: 0.8582
Epoch 78/200
Learning rate:  0.003
391/391 [==============================] - 22s 57ms/step - loss: 0.2038 - acc: 0.9278 - val_loss: 0.5597 - val_acc: 0.8509
Epoch 79/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2103 - acc: 0.9259 - val_loss: 0.4822 - val_acc: 0.8601
Epoch 80/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2081 - acc: 0.9268 - val_loss: 0.5239 - val_acc: 0.8646
Epoch 81/200
Learning rate:  0.003
391/391 [==============================] - 22s 56ms/step - loss: 0.2010 - acc: 0.9298 - val_loss: 0.4481 - val_acc: 0.8713
Epoch 82/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1662 - acc: 0.9415 - val_loss: 0.3872 - val_acc: 0.8914
Epoch 83/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1480 - acc: 0.9474 - val_loss: 0.3726 - val_acc: 0.8954
Epoch 84/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1454 - acc: 0.9495 - val_loss: 0.3805 - val_acc: 0.8969
Epoch 85/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1418 - acc: 0.9507 - val_loss: 0.3696 - val_acc: 0.8995
Epoch 86/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1354 - acc: 0.9524 - val_loss: 0.4091 - val_acc: 0.8926
Epoch 87/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1376 - acc: 0.9529 - val_loss: 0.3849 - val_acc: 0.8982
Epoch 88/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1329 - acc: 0.9526 - val_loss: 0.3839 - val_acc: 0.8963
Epoch 89/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1325 - acc: 0.9540 - val_loss: 0.3927 - val_acc: 0.8955
Epoch 90/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1291 - acc: 0.9552 - val_loss: 0.4144 - val_acc: 0.8938
Epoch 91/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1242 - acc: 0.9560 - val_loss: 0.4008 - val_acc: 0.8959
Epoch 92/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1280 - acc: 0.9556 - val_loss: 0.3801 - val_acc: 0.8991
Epoch 93/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1266 - acc: 0.9554 - val_loss: 0.4179 - val_acc: 0.8938
Epoch 94/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1291 - acc: 0.9542 - val_loss: 0.3798 - val_acc: 0.8988
Epoch 95/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1230 - acc: 0.9560 - val_loss: 0.3956 - val_acc: 0.8967
Epoch 96/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1240 - acc: 0.9561 - val_loss: 0.3911 - val_acc: 0.8991
Epoch 97/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1204 - acc: 0.9566 - val_loss: 0.3990 - val_acc: 0.8930
Epoch 98/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1192 - acc: 0.9571 - val_loss: 0.4094 - val_acc: 0.8933
Epoch 99/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1203 - acc: 0.9579 - val_loss: 0.3873 - val_acc: 0.8979
Epoch 100/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1204 - acc: 0.9571 - val_loss: 0.4031 - val_acc: 0.8955
Epoch 101/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1201 - acc: 0.9577 - val_loss: 0.3965 - val_acc: 0.8964
Epoch 102/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1189 - acc: 0.9584 - val_loss: 0.4098 - val_acc: 0.8958
Epoch 103/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1199 - acc: 0.9576 - val_loss: 0.4023 - val_acc: 0.8969
Epoch 104/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1169 - acc: 0.9579 - val_loss: 0.3881 - val_acc: 0.9008
Epoch 105/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1149 - acc: 0.9589 - val_loss: 0.3967 - val_acc: 0.8979
Epoch 106/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1176 - acc: 0.9584 - val_loss: 0.4394 - val_acc: 0.8905
Epoch 107/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1171 - acc: 0.9580 - val_loss: 0.3900 - val_acc: 0.8996
Epoch 108/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1125 - acc: 0.9606 - val_loss: 0.4027 - val_acc: 0.8974
Epoch 109/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1165 - acc: 0.9599 - val_loss: 0.4512 - val_acc: 0.8868
Epoch 110/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1120 - acc: 0.9597 - val_loss: 0.4155 - val_acc: 0.8941
Epoch 111/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1129 - acc: 0.9605 - val_loss: 0.4102 - val_acc: 0.8943
Epoch 112/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1117 - acc: 0.9601 - val_loss: 0.4293 - val_acc: 0.8920
Epoch 113/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1121 - acc: 0.9596 - val_loss: 0.4190 - val_acc: 0.8960
Epoch 114/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1120 - acc: 0.9604 - val_loss: 0.4264 - val_acc: 0.8936
Epoch 115/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1102 - acc: 0.9605 - val_loss: 0.4047 - val_acc: 0.8991
Epoch 116/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 57ms/step - loss: 0.1094 - acc: 0.9617 - val_loss: 0.4236 - val_acc: 0.8953
Epoch 117/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1098 - acc: 0.9613 - val_loss: 0.4209 - val_acc: 0.8955
Epoch 118/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1054 - acc: 0.9622 - val_loss: 0.4060 - val_acc: 0.8980
Epoch 119/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1114 - acc: 0.9610 - val_loss: 0.4069 - val_acc: 0.8986
Epoch 120/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1093 - acc: 0.9610 - val_loss: 0.4076 - val_acc: 0.9008
Epoch 121/200
Learning rate:  0.00030000000000000003
391/391 [==============================] - 22s 56ms/step - loss: 0.1094 - acc: 0.9616 - val_loss: 0.4207 - val_acc: 0.8969
Epoch 122/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1062 - acc: 0.9618 - val_loss: 0.4063 - val_acc: 0.8995
Epoch 123/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1025 - acc: 0.9633 - val_loss: 0.4078 - val_acc: 0.8994
Epoch 124/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1038 - acc: 0.9630 - val_loss: 0.4071 - val_acc: 0.8996
Epoch 125/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1038 - acc: 0.9631 - val_loss: 0.4069 - val_acc: 0.8996
Epoch 126/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1016 - acc: 0.9642 - val_loss: 0.4091 - val_acc: 0.8976
Epoch 127/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1008 - acc: 0.9636 - val_loss: 0.4060 - val_acc: 0.8990
Epoch 128/200
Learning rate:  3e-05
391/391 [==============================] - 23s 60ms/step - loss: 0.1018 - acc: 0.9637 - val_loss: 0.4087 - val_acc: 0.8998
Epoch 129/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.0994 - acc: 0.9646 - val_loss: 0.4046 - val_acc: 0.9002
Epoch 130/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1026 - acc: 0.9635 - val_loss: 0.4053 - val_acc: 0.8994
Epoch 131/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1001 - acc: 0.9648 - val_loss: 0.4039 - val_acc: 0.9002
Epoch 132/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1045 - acc: 0.9636 - val_loss: 0.4064 - val_acc: 0.8989
Epoch 133/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1051 - acc: 0.9629 - val_loss: 0.4051 - val_acc: 0.9003
Epoch 134/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1042 - acc: 0.9629 - val_loss: 0.4045 - val_acc: 0.9012
Epoch 135/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1005 - acc: 0.9644 - val_loss: 0.4094 - val_acc: 0.8986
Epoch 136/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1007 - acc: 0.9637 - val_loss: 0.4059 - val_acc: 0.8988
Epoch 137/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0993 - acc: 0.9652 - val_loss: 0.4037 - val_acc: 0.9007
Epoch 138/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1026 - acc: 0.9632 - val_loss: 0.4024 - val_acc: 0.9002
Epoch 139/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1015 - acc: 0.9643 - val_loss: 0.4072 - val_acc: 0.8990
Epoch 140/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1037 - acc: 0.9633 - val_loss: 0.4026 - val_acc: 0.9014
Epoch 141/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1013 - acc: 0.9640 - val_loss: 0.4014 - val_acc: 0.9021
Epoch 142/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1009 - acc: 0.9645 - val_loss: 0.4033 - val_acc: 0.9016
Epoch 143/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1013 - acc: 0.9644 - val_loss: 0.4071 - val_acc: 0.8994
Epoch 144/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1012 - acc: 0.9637 - val_loss: 0.4064 - val_acc: 0.8999
Epoch 145/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1000 - acc: 0.9652 - val_loss: 0.4040 - val_acc: 0.9004
Epoch 146/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0972 - acc: 0.9655 - val_loss: 0.4055 - val_acc: 0.9003
Epoch 147/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0983 - acc: 0.9648 - val_loss: 0.4027 - val_acc: 0.9012
Epoch 148/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1005 - acc: 0.9647 - val_loss: 0.4040 - val_acc: 0.9002
Epoch 149/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.1020 - acc: 0.9642 - val_loss: 0.4099 - val_acc: 0.8993
Epoch 150/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.0959 - acc: 0.9648 - val_loss: 0.4051 - val_acc: 0.8999
Epoch 151/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0999 - acc: 0.9642 - val_loss: 0.4048 - val_acc: 0.9005
Epoch 152/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0993 - acc: 0.9646 - val_loss: 0.4059 - val_acc: 0.9014
Epoch 153/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0967 - acc: 0.9657 - val_loss: 0.4090 - val_acc: 0.8997
Epoch 154/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0982 - acc: 0.9643 - val_loss: 0.4096 - val_acc: 0.8994
Epoch 155/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.1015 - acc: 0.9637 - val_loss: 0.4082 - val_acc: 0.8996
Epoch 156/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0995 - acc: 0.9646 - val_loss: 0.4058 - val_acc: 0.9007
Epoch 157/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.0996 - acc: 0.9650 - val_loss: 0.4113 - val_acc: 0.8995
Epoch 158/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0996 - acc: 0.9648 - val_loss: 0.4092 - val_acc: 0.9008
Epoch 159/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0998 - acc: 0.9649 - val_loss: 0.4081 - val_acc: 0.9005
Epoch 160/200
Learning rate:  3e-05
391/391 [==============================] - 22s 57ms/step - loss: 0.0981 - acc: 0.9655 - val_loss: 0.4060 - val_acc: 0.9009
Epoch 161/200
Learning rate:  3e-05
391/391 [==============================] - 22s 56ms/step - loss: 0.0977 - acc: 0.9647 - val_loss: 0.4092 - val_acc: 0.9011
Epoch 162/200
Learning rate:  3e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0985 - acc: 0.9649 - val_loss: 0.4070 - val_acc: 0.9014
Epoch 163/200
Learning rate:  3e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1025 - acc: 0.9640 - val_loss: 0.4081 - val_acc: 0.9011
Epoch 164/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0987 - acc: 0.9653 - val_loss: 0.4089 - val_acc: 0.9009
Epoch 165/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1010 - acc: 0.9643 - val_loss: 0.4078 - val_acc: 0.9011
Epoch 166/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0979 - acc: 0.9654 - val_loss: 0.4090 - val_acc: 0.9008
Epoch 167/200
Learning rate:  3e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1006 - acc: 0.9631 - val_loss: 0.4069 - val_acc: 0.9015
Epoch 168/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0990 - acc: 0.9642 - val_loss: 0.4080 - val_acc: 0.9016
Epoch 169/200
Learning rate:  3e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0992 - acc: 0.9648 - val_loss: 0.4064 - val_acc: 0.9014
Epoch 170/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1011 - acc: 0.9649 - val_loss: 0.4080 - val_acc: 0.9010
Epoch 171/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0979 - acc: 0.9649 - val_loss: 0.4076 - val_acc: 0.9015
Epoch 172/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0968 - acc: 0.9657 - val_loss: 0.4089 - val_acc: 0.9015
Epoch 173/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0976 - acc: 0.9650 - val_loss: 0.4079 - val_acc: 0.9016
Epoch 174/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1004 - acc: 0.9645 - val_loss: 0.4078 - val_acc: 0.9014
Epoch 175/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0993 - acc: 0.9651 - val_loss: 0.4081 - val_acc: 0.9013
Epoch 176/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1002 - acc: 0.9646 - val_loss: 0.4086 - val_acc: 0.9013
Epoch 177/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0979 - acc: 0.9652 - val_loss: 0.4069 - val_acc: 0.9015
Epoch 178/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0995 - acc: 0.9646 - val_loss: 0.4074 - val_acc: 0.9008
Epoch 179/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0995 - acc: 0.9654 - val_loss: 0.4054 - val_acc: 0.9022
Epoch 180/200
Learning rate:  3e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0991 - acc: 0.9644 - val_loss: 0.4077 - val_acc: 0.9014
Epoch 181/200
Learning rate:  3e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0991 - acc: 0.9643 - val_loss: 0.4071 - val_acc: 0.9011
Epoch 182/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0964 - acc: 0.9673 - val_loss: 0.4071 - val_acc: 0.9010
Epoch 183/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0965 - acc: 0.9660 - val_loss: 0.4076 - val_acc: 0.9013
Epoch 184/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0953 - acc: 0.9656 - val_loss: 0.4080 - val_acc: 0.9015
Epoch 185/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0975 - acc: 0.9656 - val_loss: 0.4087 - val_acc: 0.9007
Epoch 186/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1002 - acc: 0.9646 - val_loss: 0.4086 - val_acc: 0.9009
Epoch 187/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.1027 - acc: 0.9637 - val_loss: 0.4091 - val_acc: 0.9011
Epoch 188/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0993 - acc: 0.9648 - val_loss: 0.4077 - val_acc: 0.9014
Epoch 189/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0964 - acc: 0.9658 - val_loss: 0.4086 - val_acc: 0.9012
Epoch 190/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0982 - acc: 0.9652 - val_loss: 0.4085 - val_acc: 0.9010
Epoch 191/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1005 - acc: 0.9644 - val_loss: 0.4077 - val_acc: 0.9013
Epoch 192/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0989 - acc: 0.9659 - val_loss: 0.4071 - val_acc: 0.9013
Epoch 193/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.1011 - acc: 0.9637 - val_loss: 0.4097 - val_acc: 0.9006
Epoch 194/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0956 - acc: 0.9662 - val_loss: 0.4075 - val_acc: 0.9013
Epoch 195/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0993 - acc: 0.9646 - val_loss: 0.4073 - val_acc: 0.9017
Epoch 196/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0974 - acc: 0.9658 - val_loss: 0.4057 - val_acc: 0.9019
Epoch 197/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0985 - acc: 0.9647 - val_loss: 0.4068 - val_acc: 0.9019
Epoch 198/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0999 - acc: 0.9650 - val_loss: 0.4069 - val_acc: 0.9015
Epoch 199/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 56ms/step - loss: 0.0952 - acc: 0.9655 - val_loss: 0.4061 - val_acc: 0.9014
Epoch 200/200
Learning rate:  1.5e-06
391/391 [==============================] - 22s 57ms/step - loss: 0.0965 - acc: 0.9655 - val_loss: 0.4084 - val_acc: 0.9008